<h1 style="color: black; text-align: center; font-family: Arial, sans-serif; font-size: 32px;">
  BASICS OF DATA FRAME 
</h1>

In [ ]:
#EXP NO 3
#AIM:BASICS OF DATA FRAME

In [ ]:
#Name:Om M. Kadu
#Rollno:27
#Sec:B
#Subject:Dss

In [1]:
#import pandas library
import pandas as pd

In [11]:
#Creating Data Frame
df=pd.DataFrame([[10,12,15,17],[15,14,11,16],[14,11,19,17]],
columns=["CD","DBMS","CAO","DSS"])

In [12]:
df

   CD  DBMS  CAO  DSS
0  10    12   15   17
1  15    14   11   16
2  14    11   19   17

In [6]:
df.shape

(3, 4)

In [7]:
df.size

12

In [9]:
df.ndim

2

In [13]:
df2=pd.DataFrame([[5,6,7,8]],
columns=["CD","CAO","DSS","DBMS"])

In [20]:
df3=df.append(df2,ignore_index=True)

In [21]:
df3

   CD  DBMS  CAO  DSS
0  10    12   15   17
1  15    14   11   16
2  14    11   19   17
3   5     8    6    7

# Adding Attribute (Columns) name DM

In [26]:
df3["DM"]=[12,15,16,14]

In [27]:
df3

   CD  DBMS  CAO  DSS  DM
0  10    12   15   17  12
1  15    14   11   16  15
2  14    11   19   17  16
3   5     8    6    7  14

In [28]:
df4=df3.drop(index=[1])

In [29]:
df4

   CD  DBMS  CAO  DSS  DM
0  10    12   15   17  12
2  14    11   19   17  16
3   5     8    6    7  14

In [32]:
df5=df3.drop(columns=["DM"])

In [33]:
df5

   CD  DBMS  CAO  DSS
0  10    12   15   17
1  15    14   11   16
2  14    11   19   17
3   5     8    6    7

In [41]:
#Finding mean of Dss

print("Mean of DSS:", df5["DSS"].mean())

Mean of DSS: 14.25

In [42]:
#Finding median of Dss

print("Median of DSS:", df5["DSS"].median())

Median of DSS: 16.5

In [43]:
#Finding mode of Dss

print("Mode of DSS:", df5["DSS"].mode())

Mode of DSS: 0    17
dtype: int64

In [50]:
#Finding min of Dss

print("Min of DSS:", df5["DSS"].min())

Min of DSS: 7

In [51]:
#Finding max of Dss

print("Max of DSS:", df5["DSS"].max())

Max of DSS: 17

In [52]:
#Creating Student Name List
Name=["harshal","kartik","shrihari","shriram"]
Name

['harshal', 'kartik', 'shrihari', 'shriram']

In [55]:
#Creating a Series
Roll_list=pd.Series(Name,index=[1,2,3,4])
print(Roll_list)

1     harshal
2      kartik
3    shrihari
4     shriram
dtype: object